contiki-os/contiki/cc26xxware/inc/hw_ccfg.h
/******************************************************************************
*  Filename:       hw_ccfg.h
*  Revised:        $Date$
*  Revision:       $Revision$
*
* Copyright (c) 2015, Texas Instruments Incorporated
* All rights reserved.
*
* Redistribution and use in source and binary forms, with or without
* modification, are permitted provided that the following conditions are met:
*
* 1) Redistributions of source code must retain the above copyright notice,
*    this list of conditions and the following disclaimer.
*
* 2) Redistributions in binary form must reproduce the above copyright notice,
*    this list of conditions and the following disclaimer in the documentation
*    and/or other materials provided with the distribution.
*
* 3) Neither the name of the ORGANIZATION nor the names of its contributors may
*    be used to endorse or promote products derived from this software without
*    specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
* AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
* IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
* ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
* LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
* CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
* SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
* CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
* ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
* POSSIBILITY OF SUCH DAMAGE.
*
******************************************************************************/

#ifndef __HW_CCFG_H__
#define __HW_CCFG_H__


//*****************************************************************************
//
// This section defines the register offsets of
// CCFG component
//
//*****************************************************************************
// Mode Configuration 1
#define CCFG_O_MODE_CONF_1                                          0x00000FAC

// CCFG Size and Disable Flags
#define CCFG_O_SIZE_AND_DIS_FLAGS                                   0x00000FB0

// Mode Configuration 0
#define CCFG_O_MODE_CONF                                            0x00000FB4

// Voltage Load 0
#define CCFG_O_VOLT_LOAD_0                                          0x00000FB8

// Voltage Load 1
#define CCFG_O_VOLT_LOAD_1                                          0x00000FBC

// Real Time Clock Offset
#define CCFG_O_RTC_OFFSET                                           0x00000FC0

// Frequency Offset
#define CCFG_O_FREQ_OFFSET                                          0x00000FC4

// IEEE MAC Address 0
#define CCFG_O_IEEE_MAC_0                                           0x00000FC8

// IEEE MAC Address 1
#define CCFG_O_IEEE_MAC_1                                           0x00000FCC

// IEEE BLE Address 0
#define CCFG_O_IEEE_BLE_0                                           0x00000FD0

// IEEE BLE Address 1
#define CCFG_O_IEEE_BLE_1                                           0x00000FD4

// Bootloader Config
#define CCFG_O_BL_CONFIG                                            0x00000FD8

// Erase Configuration
#define CCFG_O_ERASE_CONF                                           0x00000FDC

// TI Options
#define CCFG_O_CCFG_TI_OPTIONS                                      0x00000FE0

// Test Access Points Enable 0
#define CCFG_O_CCFG_TAP_DAP_0                                       0x00000FE4

// Test Access Points Enable 1
#define CCFG_O_CCFG_TAP_DAP_1                                       0x00000FE8

// Image Valid
#define CCFG_O_IMAGE_VALID_CONF                                     0x00000FEC

// Protect Sectors 0-31
#define CCFG_O_CCFG_PROT_31_0                                       0x00000FF0

// Protect Sectors 32-63
#define CCFG_O_CCFG_PROT_63_32                                      0x00000FF4

// Protect Sectors 64-95
#define CCFG_O_CCFG_PROT_95_64                                      0x00000FF8

// Protect Sectors 96-127
#define CCFG_O_CCFG_PROT_127_96                                     0x00000FFC

//*****************************************************************************
//
// Register: CCFG_O_MODE_CONF_1
//
//*****************************************************************************
// Field: [23:20] ALT_DCDC_VMIN
//
// Minimum voltage to use DC/DC is (28 + ALT_DCDC_VMIN)/16.
// 0: 1.75V
// 1: 1.8125V
//  .
//  .
// 14: 2.625V
// 15: 2.6875V
#define CCFG_MODE_CONF_1_ALT_DCDC_VMIN_M                            0x00F00000
#define CCFG_MODE_CONF_1_ALT_DCDC_VMIN_S                            20

// Field: [19]    ALT_DCDC_DITHER_EN
//
// Enable DC/DC dithering
#define CCFG_MODE_CONF_1_ALT_DCDC_DITHER_EN                         0x00080000
#define CCFG_MODE_CONF_1_ALT_DCDC_DITHER_EN_BITN                    19
#define CCFG_MODE_CONF_1_ALT_DCDC_DITHER_EN_M                       0x00080000
#define CCFG_MODE_CONF_1_ALT_DCDC_DITHER_EN_S                       19

// Field: [18:16] ALT_DCDC_IPEAK
//
// Inductor peak current.
// 0: Min 31mA
// 4: Typical 47mA
// 7: Max 59mA
#define CCFG_MODE_CONF_1_ALT_DCDC_IPEAK_M                           0x00070000
#define CCFG_MODE_CONF_1_ALT_DCDC_IPEAK_S                           16

// Field: [15:12] DELTA_IBIAS_INIT
//
// Signed delta value for IBIAS_INIT
#define CCFG_MODE_CONF_1_DELTA_IBIAS_INIT_M                         0x0000F000
#define CCFG_MODE_CONF_1_DELTA_IBIAS_INIT_S                         12

// Field: [11:8] DELTA_IBIAS_OFFSET
//
// Signed delta value for IBIAS_OFFSET
#define CCFG_MODE_CONF_1_DELTA_IBIAS_OFFSET_M                       0x00000F00
#define CCFG_MODE_CONF_1_DELTA_IBIAS_OFFSET_S                       8

// Field: [7:0] XOSC_MAX_START
//
// Unsigned value of maximum XOSC startup time in units of 100us
#define CCFG_MODE_CONF_1_XOSC_MAX_START_M                           0x000000FF
#define CCFG_MODE_CONF_1_XOSC_MAX_START_S                           0

//*****************************************************************************
//
// Register: CCFG_O_SIZE_AND_DIS_FLAGS
//
//*****************************************************************************
// Field: [31:16] SIZE_OF_CCFG
//
// Total size of CCFG
#define CCFG_SIZE_AND_DIS_FLAGS_SIZE_OF_CCFG_M                      0xFFFF0000
#define CCFG_SIZE_AND_DIS_FLAGS_SIZE_OF_CCFG_S                      16

// Field: [15:2] DISABLE_FLAGS
//
// Reserved for functionality disable flags.
// Currently unused.
#define CCFG_SIZE_AND_DIS_FLAGS_DISABLE_FLAGS_M                     0x0000FFFC
#define CCFG_SIZE_AND_DIS_FLAGS_DISABLE_FLAGS_S                     2

// Field: [1]    DIS_ALT_DCDC_SETTING
//
// Disable flag for alternative DCDC setting
#define CCFG_SIZE_AND_DIS_FLAGS_DIS_ALT_DCDC_SETTING                0x00000002
#define CCFG_SIZE_AND_DIS_FLAGS_DIS_ALT_DCDC_SETTING_BITN           1
#define CCFG_SIZE_AND_DIS_FLAGS_DIS_ALT_DCDC_SETTING_M              0x00000002
#define CCFG_SIZE_AND_DIS_FLAGS_DIS_ALT_DCDC_SETTING_S              1

// Field: [0]    DIS_XOSC_OVR
//
// Disable flag for XOSC override functionality.
#define CCFG_SIZE_AND_DIS_FLAGS_DIS_XOSC_OVR                        0x00000001
#define CCFG_SIZE_AND_DIS_FLAGS_DIS_XOSC_OVR_BITN                   0
#define CCFG_SIZE_AND_DIS_FLAGS_DIS_XOSC_OVR_M                      0x00000001
#define CCFG_SIZE_AND_DIS_FLAGS_DIS_XOSC_OVR_S                      0

//*****************************************************************************
//
// Register: CCFG_O_MODE_CONF
//
//*****************************************************************************
// Field: [27]    DCDC_RECHARGE
//
// 0: Use the DC/DC during recharge in powerdown
// 1:Do not use the DC/DC during recharge in powerdown (default)
#define CCFG_MODE_CONF_DCDC_RECHARGE                                0x08000000
#define CCFG_MODE_CONF_DCDC_RECHARGE_BITN                           27
#define CCFG_MODE_CONF_DCDC_RECHARGE_M                              0x08000000
#define CCFG_MODE_CONF_DCDC_RECHARGE_S                              27

// Field: [26]    DCDC_ACTIVE
//
// 0: Use the DC/DC during active mode
// 1: Do not use the DC/DC during active mode (default)
#define CCFG_MODE_CONF_DCDC_ACTIVE                                  0x04000000
#define CCFG_MODE_CONF_DCDC_ACTIVE_BITN                             26
#define CCFG_MODE_CONF_DCDC_ACTIVE_M                                0x04000000
#define CCFG_MODE_CONF_DCDC_ACTIVE_S                                26

// Field: [25]    VDDR_EXT_LOAD
//
// 0: VDDR may be loaded externally (may not be supported)
// 1: VDDR is not loaded externally (default)
#define CCFG_MODE_CONF_VDDR_EXT_LOAD                                0x02000000
#define CCFG_MODE_CONF_VDDR_EXT_LOAD_BITN                           25
#define CCFG_MODE_CONF_VDDR_EXT_LOAD_M                              0x02000000
#define CCFG_MODE_CONF_VDDR_EXT_LOAD_S                              25

// Field: [24]    VDDS_BOD_LEVEL
//
// 1: VDDS BOD level is 1.8V (or 1.65V for external regulator mode) (default).
// 0: VDDS BOD level is 2.0V (necessary for 125 degrees C or for external load
// mode, or for maximum PA output power on CC13xx).
//
// Note that production devices meant for 125 degrees C operation will have a
// VDDS_BOD level of 2.0V trimmed in e-fuse, which means that this field will have
// no function on these devices.
#define CCFG_MODE_CONF_VDDS_BOD_LEVEL                               0x01000000
#define CCFG_MODE_CONF_VDDS_BOD_LEVEL_BITN                          24
#define CCFG_MODE_CONF_VDDS_BOD_LEVEL_M                             0x01000000
#define CCFG_MODE_CONF_VDDS_BOD_LEVEL_S                             24

// Field: [23:22] SCLK_LF_OPTION
//
// 0: Low frequency clock derived from High Frequency XOSC
// 1: TBD: Digital input from AON (selects XOSC_LF as source and
// XOSC_LF_DIG_BYPASS=1)
// 2: Low frequency XOSC
// 3: Low frequency RCOSC (default)
#define CCFG_MODE_CONF_SCLK_LF_OPTION_M                             0x00C00000
#define CCFG_MODE_CONF_SCLK_LF_OPTION_S                             22

