contiki-os/contiki/cc26xxware/inc/hw_ccfg.h
// Field: [20]    RTC_COMP
//
// 0: Apply RTC temperature compensation (may not be supported)
// 1: Don't apply temperature compensation to the RTC (default)
#define CCFG_MODE_CONF_RTC_COMP                                     0x00100000
#define CCFG_MODE_CONF_RTC_COMP_BITN                                20
#define CCFG_MODE_CONF_RTC_COMP_M                                   0x00100000
#define CCFG_MODE_CONF_RTC_COMP_S                                   20

// Field: [19:18] XOSC_FREQ
//
// 00: MEMS, reserved
// 01: BAW, reserved
// 10: 48MHz (may not be supported)
// 11: 24MHz (default)
#define CCFG_MODE_CONF_XOSC_FREQ_M                                  0x000C0000
#define CCFG_MODE_CONF_XOSC_FREQ_S                                  18

// Field: [17]    XOSC_CAP_MOD
//
// 0: Apply cap-array delta (may not be supported)
// 1: Don't apply cap-array delta (default)
//
#define CCFG_MODE_CONF_XOSC_CAP_MOD                                 0x00020000
#define CCFG_MODE_CONF_XOSC_CAP_MOD_BITN                            17
#define CCFG_MODE_CONF_XOSC_CAP_MOD_M                               0x00020000
#define CCFG_MODE_CONF_XOSC_CAP_MOD_S                               17

// Field: [16]    HF_COMP
//
// 0: Apply 48MHz compensation (may not be supported)
// 1: Don't apply 48MHz frequency compensation (default)
#define CCFG_MODE_CONF_HF_COMP                                      0x00010000
#define CCFG_MODE_CONF_HF_COMP_BITN                                 16
#define CCFG_MODE_CONF_HF_COMP_M                                    0x00010000
#define CCFG_MODE_CONF_HF_COMP_S                                    16

// Field: [15:8] XOSC_CAPARRAY_DELTA
//
// Signed 8-bit value, directly modifying trimmed XOSC cap-array value.
#define CCFG_MODE_CONF_XOSC_CAPARRAY_DELTA_M                        0x0000FF00
#define CCFG_MODE_CONF_XOSC_CAPARRAY_DELTA_S                        8

// Field: [7:0] VDDR_CAP
//
// Unsigned 8-bit integer, representing the minimum decoupling capacitance on VDDR,
// in units of 100nF. This should take into account capacitor tolerance and voltage
// dependent capacitance variation.
#define CCFG_MODE_CONF_VDDR_CAP_M                                   0x000000FF
#define CCFG_MODE_CONF_VDDR_CAP_S                                   0

//*****************************************************************************
//
// Register: CCFG_O_VOLT_LOAD_0
//
//*****************************************************************************
// Field: [31:24] VDDR_EXT_TP45
//
// Maximum external VDDR load in powerdown at +45C, on a log2 scale with 4
// fractional bits.
// Current is defined as 10nA*2^N/16
#define CCFG_VOLT_LOAD_0_VDDR_EXT_TP45_M                            0xFF000000
#define CCFG_VOLT_LOAD_0_VDDR_EXT_TP45_S                            24

// Field: [23:16] VDDR_EXT_TP25
//
// Maximum external VDDR load in powerdown at +25C, on a log2 scale with 4
// fractional bits.
// Current is defined as 10nA*2^N/16
#define CCFG_VOLT_LOAD_0_VDDR_EXT_TP25_M                            0x00FF0000
#define CCFG_VOLT_LOAD_0_VDDR_EXT_TP25_S                            16

// Field: [15:8] VDDR_EXT_TP5
//
// Maximum external VDDR load in powerdown at +5C, on a log2 scale with 4
// fractional bits.
// Current is defined as 10nA*2^N/16
#define CCFG_VOLT_LOAD_0_VDDR_EXT_TP5_M                             0x0000FF00
#define CCFG_VOLT_LOAD_0_VDDR_EXT_TP5_S                             8

// Field: [7:0] VDDR_EXT_TM15
//
// Maximum external VDDR load in powerdown at -15C, on a log2 scale with 4
// fractional bits.
// Current is defined as 10nA*2^N/16
#define CCFG_VOLT_LOAD_0_VDDR_EXT_TM15_M                            0x000000FF
#define CCFG_VOLT_LOAD_0_VDDR_EXT_TM15_S                            0

//*****************************************************************************
//
// Register: CCFG_O_VOLT_LOAD_1
//
//*****************************************************************************
// Field: [31:24] VDDR_EXT_TP125
//
// Maximum external VDDR load in powerdown at +125C, on a log2 scale with 4
// fractional bits.
// Current is defined as 10nA*2^N/16
#define CCFG_VOLT_LOAD_1_VDDR_EXT_TP125_M                           0xFF000000
#define CCFG_VOLT_LOAD_1_VDDR_EXT_TP125_S                           24

// Field: [23:16] VDDR_EXT_TP105
//
// Maximum external VDDR load in powerdown at +105C, on a log2 scale with 4
// fractional bits.
// Current is defined as 10nA*2^N/16
#define CCFG_VOLT_LOAD_1_VDDR_EXT_TP105_M                           0x00FF0000
#define CCFG_VOLT_LOAD_1_VDDR_EXT_TP105_S                           16

// Field: [15:8] VDDR_EXT_TP85
//
// Maximum external VDDR load in powerdown at +85C, on a log2 scale with 4
// fractional bits.
// Current is defined as 10nA*2^N/16
#define CCFG_VOLT_LOAD_1_VDDR_EXT_TP85_M                            0x0000FF00
#define CCFG_VOLT_LOAD_1_VDDR_EXT_TP85_S                            8

// Field: [7:0] VDDR_EXT_TP65
//
// Maximum external VDDR load in powerdown at +65C, on a log2 scale with 4
// fractional bits.
// Current is defined as 10nA*2^N/16
#define CCFG_VOLT_LOAD_1_VDDR_EXT_TP65_M                            0x000000FF
#define CCFG_VOLT_LOAD_1_VDDR_EXT_TP65_S                            0

//*****************************************************************************
//
// Register: CCFG_O_RTC_OFFSET
//
//*****************************************************************************
// Field: [31:16] RTC_COMP_P0
//
// Signed 16-bit value, representing the RTC offset at 27 degrees C.
#define CCFG_RTC_OFFSET_RTC_COMP_P0_M                               0xFFFF0000
#define CCFG_RTC_OFFSET_RTC_COMP_P0_S                               16

// Field: [15:8] RTC_COMP_P1
//
// Signed 8-bit value, representing the first order RTC offset slope.
#define CCFG_RTC_OFFSET_RTC_COMP_P1_M                               0x0000FF00
#define CCFG_RTC_OFFSET_RTC_COMP_P1_S                               8

// Field: [7:0] RTC_COMP_P2
//
// Signed 8-bit value, representing the second order RTC offset slope. The actual
// RTC accumulation value would be defined as 1/32768*(1+d), where
// d = P0*2^(-20) + P1*(T-27)*2^(-21) + P2*(T-27)^2*2^(-27).
#define CCFG_RTC_OFFSET_RTC_COMP_P2_M                               0x000000FF
#define CCFG_RTC_OFFSET_RTC_COMP_P2_S                               0

//*****************************************************************************
//
// Register: CCFG_O_FREQ_OFFSET
//
//*****************************************************************************
// Field: [31:16] HF_COMP_P0
//
// Signed 16-bit value, representing the frequency offset at 27 degrees C.
#define CCFG_FREQ_OFFSET_HF_COMP_P0_M                               0xFFFF0000
#define CCFG_FREQ_OFFSET_HF_COMP_P0_S                               16

// Field: [15:8] HF_COMP_P1
//
// Signed 8-bit value, representing the first order frequency offset slope.
#define CCFG_FREQ_OFFSET_HF_COMP_P1_M                               0x0000FF00
#define CCFG_FREQ_OFFSET_HF_COMP_P1_S                               8

// Field: [7:0] HF_COMP_P2
//
// Signed 8-bit value, representing the second order frequency offset slope. The
// actual frequency of the clock would be defined as 48MHz*(1+d), where
// d = P0*2(-22) + P1*(T-27)*2^(-25) + P2*(T-27)^2*2^(-31).
#define CCFG_FREQ_OFFSET_HF_COMP_P2_M                               0x000000FF
#define CCFG_FREQ_OFFSET_HF_COMP_P2_S                               0

//*****************************************************************************
//
// Register: CCFG_O_IEEE_MAC_0
//
//*****************************************************************************
// Field: [31:0] ADDR
//
// Bits[31:0] of the 64-bits IEEE MAC address
#define CCFG_IEEE_MAC_0_ADDR_M                                      0xFFFFFFFF
#define CCFG_IEEE_MAC_0_ADDR_S                                      0

//*****************************************************************************
//
// Register: CCFG_O_IEEE_MAC_1
//
//*****************************************************************************
// Field: [31:0] ADDR
//
// Bits[63:32] of the 64-bits IEEE MAC address
#define CCFG_IEEE_MAC_1_ADDR_M                                      0xFFFFFFFF
#define CCFG_IEEE_MAC_1_ADDR_S                                      0

//*****************************************************************************
//
// Register: CCFG_O_IEEE_BLE_0
//
//*****************************************************************************
// Field: [31:0] ADDR
//
// Bits[31:0] of the 64-bits IEEE BLE address
#define CCFG_IEEE_BLE_0_ADDR_M                                      0xFFFFFFFF
#define CCFG_IEEE_BLE_0_ADDR_S                                      0

//*****************************************************************************
//
// Register: CCFG_O_IEEE_BLE_1
//
//*****************************************************************************
// Field: [31:0] ADDR
//
// Bits[63:32] of the 64-bits IEEE BLE address
#define CCFG_IEEE_BLE_1_ADDR_M                                      0xFFFFFFFF
#define CCFG_IEEE_BLE_1_ADDR_S                                      0

//*****************************************************************************
//
// Register: CCFG_O_BL_CONFIG
//
//*****************************************************************************
// Field: [31:24] BOOTLOADER_ENABLE
//
// 0xC5: Boot loader is enabled
// Any other value: Boot loader is disabled
//
// NOTE! This parameter must be written to the value of 0xC5 by production test.
//
#define CCFG_BL_CONFIG_BOOTLOADER_ENABLE_M                          0xFF000000
#define CCFG_BL_CONFIG_BOOTLOADER_ENABLE_S                          24

// Field: [16]    BL_LEVEL
//
// BL_LEVEL - sets the active level of the selected pin.
//
// 0: Active low.
// 1: Active high.
#define CCFG_BL_CONFIG_BL_LEVEL                                     0x00010000
#define CCFG_BL_CONFIG_BL_LEVEL_BITN                                16
#define CCFG_BL_CONFIG_BL_LEVEL_M                                   0x00010000
#define CCFG_BL_CONFIG_BL_LEVEL_S                                   16

// Field: [15:8] BL_PIN_NUMBER
//
// BL_PIN_NUMBER - is the number of the I/O-pin that is level checked if the boot
// loader failure analysis is enabled.
#define CCFG_BL_CONFIG_BL_PIN_NUMBER_M                              0x0000FF00
#define CCFG_BL_CONFIG_BL_PIN_NUMBER_S                              8

// Field: [7:0] BL_ENABLE
//
// BL_ENABLE - enables or disables the boot loader failure analysis..
//
// 0xC5: Failure analysis enabled.
// Any other value: Failure analysis disabled.
#define CCFG_BL_CONFIG_BL_ENABLE_M                                  0x000000FF
#define CCFG_BL_CONFIG_BL_ENABLE_S                                  0

//*****************************************************************************
//
// Register: CCFG_O_ERASE_CONF
//
//*****************************************************************************
// Field: [8]    CHIP_ERASE_DIS_N
//
// 0: Any chip erase request detected during boot will be ignored. The boot FW will
// clear AON_WUC:CTL1.CHIP_ERASE and proceed with normal boot sequence.
// 1: Any chip erase request detected during boot will be performed by the boot
// FW.
//
#define CCFG_ERASE_CONF_CHIP_ERASE_DIS_N                            0x00000100
#define CCFG_ERASE_CONF_CHIP_ERASE_DIS_N_BITN                       8
#define CCFG_ERASE_CONF_CHIP_ERASE_DIS_N_M                          0x00000100
#define CCFG_ERASE_CONF_CHIP_ERASE_DIS_N_S                          8

// Field: [0]    BANK_ERASE_DIS_N
//
// Setting this bit to 0 will disable the boot loader bank erase function.
// This bit will be tested by the ROM boot loader in order to verify if a
// received Bank Erase boot loader command can be executed or not.
// Bank erase is also referred to as mass erase.
//
#define CCFG_ERASE_CONF_BANK_ERASE_DIS_N                            0x00000001
#define CCFG_ERASE_CONF_BANK_ERASE_DIS_N_BITN                       0
#define CCFG_ERASE_CONF_BANK_ERASE_DIS_N_M                          0x00000001
#define CCFG_ERASE_CONF_BANK_ERASE_DIS_N_S                          0

//*****************************************************************************
//
// Register: CCFG_O_CCFG_TI_OPTIONS
//
//*****************************************************************************
// Field: [7:0] TI_FA_ENABLE
//
// Must have a value of 0xC5 in order to enable the functionality of unlocking the
// TI FA (TI Failure Analysis) option with the unlock code.
// All other values will disable the functionality of unlocking the TI FA option
// with the unlock code.
// Unlock is configured by ROM startup code while in safezone dependent on
// TI_FA_ENABLE.
//
// NOTE! This parameter must be written to the value of 0xC5 by production test.
//
#define CCFG_CCFG_TI_OPTIONS_TI_FA_ENABLE_M                         0x000000FF
#define CCFG_CCFG_TI_OPTIONS_TI_FA_ENABLE_S                         0

//*****************************************************************************
//
// Register: CCFG_O_CCFG_TAP_DAP_0
//
//*****************************************************************************
// Field: [23:16] CPU_DAP_ENABLE
//
// 0xC5: AON_WUC:JTAGCFG.CPU_DAP will be set to 1 if
// FCFG1:FCFG1_TAP_DAP_0.CPU_DAP_ENABLE also have a value of 0xC5. Bit field is
// written by boot FW while in safezone.
//
// Any other value: AON_WUC:JTAGCFG.CPU_DAP will be set to 0 by boot FW while
// in safezone.
//
// NOTE! This parameter must be written to the value of 0xC5 by production test.
#define CCFG_CCFG_TAP_DAP_0_CPU_DAP_ENABLE_M                        0x00FF0000
#define CCFG_CCFG_TAP_DAP_0_CPU_DAP_ENABLE_S                        16

// Field: [15:8] PRCM_TAP_ENABLE
//
// 0xC5: AON_WUC:JTAGCFG.PRCM_TAP will be set to 1 if
// FCFG1:FCFG1_TAP_DAP_0.PRCM_TAP_ENABLE also have a value of 0xC5. Bit field is
// written by boot FW while in safezone.
//
// Any other value: AON_WUC:JTAGCFG.PRCM_TAP will be set to 0 by boot FW while
// in safezone.
//
// NOTE! This parameter must be written to the value of 0xC5 by production test.
#define CCFG_CCFG_TAP_DAP_0_PRCM_TAP_ENABLE_M                       0x0000FF00
#define CCFG_CCFG_TAP_DAP_0_PRCM_TAP_ENABLE_S                       8

// Field: [7:0] TEST_TAP_ENABLE
//
// 0xC5: AON_WUC:JTAGCFG.TEST_TAP will be set to 1 if
// FCFG1:FCFG1_TAP_DAP_0.TEST_TAP_ENABLE also have a value of 0xC5. Bit field is
// written by boot FW while in safezone.
//
// Any other value: AON_WUC:JTAGCFG.TEST_TAP will be set to 0 by boot FW while
// in safezone.
//
// NOTE! This parameter must be written to the value of 0xC5 by production test.
#define CCFG_CCFG_TAP_DAP_0_TEST_TAP_ENABLE_M                       0x000000FF
#define CCFG_CCFG_TAP_DAP_0_TEST_TAP_ENABLE_S                       0

//*****************************************************************************
//
// Register: CCFG_O_CCFG_TAP_DAP_1
//
//*****************************************************************************
// Field: [23:16] PBIST2_TAP_ENABLE
//
// 0xC5: AON_WUC:JTAGCFG.PBIST2_TAP will be set to 1 if
// FCFG1:FCFG1_TAP_DAP_1.PBIST2_TAP_ENABLE also have a value of 0xC5. Bit field is
// written by boot FW while in safezone.
//
// Any other value: AON_WUC:JTAGCFG.PBIST2_TAP will be set to 0 by boot FW
// while in safezone.
//
// NOTE! This parameter must be written to the value of 0xC5 by production test.
#define CCFG_CCFG_TAP_DAP_1_PBIST2_TAP_ENABLE_M                     0x00FF0000
#define CCFG_CCFG_TAP_DAP_1_PBIST2_TAP_ENABLE_S                     16

